# Мой путь от студента-бухгалтера к фронт-разработчику

В этой статье я расскажу о своем переходе в техническую сферу, о том, как я получила свою первую работу в качестве веб-разработчика, поделюсь ресурсами и советами.

## Мой бекграунд

Недавно я окончила [Nnamdi Azikwe University](https://unizik.edu.ng/), Awka, Anambra state. Моей специальностью является бухгалтерский учет и финансы.

## Мой путь

Я написалa свой первый HTML-код в сентябре 2018 года, было супер увлекательно увидеть мой первый «Hello World» на экране браузера. Это было мое первое знакомство с тем, что такое веб, потому что детстве у меня было мало возможностей близко познакомиться с компьютерами.

В моем университете после каждой сессии обычно следует перерыв или каникулы около трех месяцев. Мои первые 3 года были сосредоточены на изучении бухгалтерских концепций и их применении в реальных компаниях.

На третьем году обучения после каникул я начала искать места для прохождения стажировки, где я могла бы пройти практику в качестве бухгалтера и получить реальный опыт. Я обратилась в [Большую четверку бухгалтерских фирм](https://en.wikipedia.org/wiki/Big_Four_accounting_firms) и даже в несколько небольших аудиторских и бухгалтерских фирм для прохождения интернатуры, но мне так и не удалось получить место.

Итак, проснувшись однажды утром в сентябре после целого месяца поисков стажировки, я отправилась в фирму в victoria island, Лагос, где подала заявку. Это была не бухгалтерская фирма, а компания, в бухгалтерском отделе которой я хотела работать. Я спросила HR: *«почему мне так трудно найти место для прохождения практики»*, и это был ее ответ,

> «Если вы искали место и не смогли его найти, почему бы вам не приобрести навык в области технологий. Техническая сфера принимает любого, кто хочет учиться, создавать и расти».

И так все и началось

Я ушла домой озадаченной, думая о том, что же представляет собой сфера технологий. Тогда я думала, что если я знаю Microsoft office, я уже в сфере технологий.

Я взяла свой ноутбук, 11-дюймовый HP Stream, который я использую для работы в Интернете, сдачи экзаменов и просмотра корейских фильмов, и провела небольшое исследование в области технологий и тех сфер в ней, что тогда показались мне интересным.

И все это для меня не имело никакого смысла. И тогда я вспомнила, что у меня есть друг-программист. Я сразу же связалась с ним и назначила встречу.

На следующий день он согласился встретиться со мной, и я рассказала ему, что рассматриваю сферу технологий, но я немного растеряна, потому что область знаний очень большая. Поэтому он задал мне несколько вопросов, таких как: есть ли у меня интерес к дизайну? пишу ли я хорошие статьи и многие другие, но на тот момент у меня не было на них точных ответов, однако одну вещь я знала наверняка: я хотела воплощать идеи в жизнь. Я спросила его, насколько сложно изучать программирование, а затем он спросил, есть ли кто-нибудь в области технологий, кем я восхищаюсь. В то время я знала только об **[Ири Адеринокун](https://twitter.com/ireaderinokun)** потому, что читала о ней в блогах и газетах.

Затем он спросил может ли он показать мне что-то и зашел на сайт **[Ire Aderinokun](https://ireaderinokun.com/)**, открыл консоль разработчика, о существовании которой на тот момент времени я даже не знала, затем щелкнул на элемент и отредактировал его так, чтобы он просил меня написать мое имя. Я написала свое имя Amaechi Amarachi, и оно появилось на экране. Затем Стивен сказал, что программирование настолько простое. Именно так у меня появился интерес, который в конечном итоге привел к увлечению разработкой интерфейсов, и так начался мой путь.

Я пошла домой очень взволнованная моим новым приключением, начала искать ресурсы, которые помогли бы мне во всем разобраться, так я нашла [Github Education](https://education.github.com/) и многие другие. Все мое обучение было онлайн, поэтому я могу называть себя самоучкой.

## Ресурсы
Это список некоторых ресурсов, которые я использовала во время своего учебного пути.
1) **[Freecodecamp](http://freecodecamp.org/)**
2) **[JavaScript: Understanding the Weird Parts](https://www.udemy.com/course/understand-javascript/?utm_source=adwords&utm_medium=udemyads&utm_campaign=JavaScript_v.PROF_la.EN_cc.ROW_ti.6368&utm_content=deal4584&utm_term=_._ag_85479007594_._ad_395279883056_._kw__._de_c_._dm__._pl__._ti_dsa-774930039569_._li_1010294_._pd__._&matchtype=b&gclid=Cj0KCQiAjfvwBRCkARIsAIqSWlMwVe7DzhxuLqkHelkWyBDmZwQ679JN7LP8m58_hr1u1lXN3SyPZAQaAg8NEALw_wcB)**
3) **[The Web development Bootcamp by coltsteele Udemy](https://www.udemy.com/course/the-web-developer-bootcamp/)**
4) **[CS50’s Introduction to Computer Science edX Team](https://www.edx.org/course/cs50s-introduction-to-computer-science)**
5) **[React @Scrimba](https://scrimba.com/g/glearnreact)**
6) **[Become a professional React developer @ Scrimba](https://scrimba.com/g/greact)**
7) **[Data structure and algorithm HackerEarth](https://www.hackerearth.com/)**
8) **[Hackerank](https://www.hackerrank.com/)**

## YouTube
9) **[Traversy media](https://www.youtube.com/user/TechGuyWeb)**
10) **[Freecodecamp](https://www.youtube.com/channel/UC8butISFwT-Wl7EV0hUK0BQ)**
11) **[Coding Phase](https://www.youtube.com/channel/UC46wWUso9H5KPQcoL9iE3Ug)**

## Каким был мой учебный процесс?

После того как я написала твит о том, что получила свою первую работу в качестве frontend developerа, я получила тонны личных сообщений с вопросами о том, как я поменяла сферу деятельности и каков был мой учебный процесс.

Как было сказано ранее, я написала свой первый HTML-код в сентябре 2018 года во время каникул и начала свое обучение с YouTube видеороликов и платформы freecodecamp.

Я должна была вернуться на учебу в ноябре, но из-за забастовки [Союза академических сотрудников (ASUU)](https://en.wikipedia.org/wiki/Academic_Staff_Union_of_Universities), которая началась в понедельник 5 ноября 2018 года и закончилась 8 февраля 2019 года, я не смогла этого сделать. Так что это была прекрасная возможность учиться больше.

Я возобновила учебу на последнем курсе в феврале 2019 года. У меня не было времени для написания кода во время каникул, потому что я должна была сосредоточиться на том, что было на тогда на первом месте, а именно на предстоящих выпускных экзаменах, финальных проектах и защите. Вместе с этим я решила ежедневно посвящать 3 часа обучению программированию, что я и сделала.

К ноябрю я уже сдала экзамены и защитила свою выпускную работу, которая былаа озаглавлен: **«Особенности корпоративного управления и добавленная стоимость: свидетельство из банка депозитных денег»**.

## Началась новая фаза: поиск работы
В декабре после сдачи экзаменов я переехала обратно в Лагос, Нигерия, из Ауки, Анамбра. Друзья и родственники начали задавать обычный вопрос: "Ты закончила учебу, чем займешься дальше?". Сначала я ответила, что хотела бы использовать первые 3 месяца 2020 года для обучения и оттачивания своих навыков, чтобы быть готовой к подаче заявления на позицию фронтенд девелопера. Я поговорила об этом со своим лучшим другом, и он сказал: ЗАЧЕМ ты будешь ждать 3 месяца, почему бы тебе не начать подавать заявления прямо сейчас и продолжать учиться прямо на работе. Затем, зная, что у меня нет большого опыта в этой области, я все-таки набралась смелости и начала подавать заявления на различные вакансии, которые я видела в LinkedIn, Twitter и т.д.

Угадайте, кого даже не пригласили ни на одно собеседование? Меня.

Когда я заметила то, как идут дела, я сделала шаг назад и разработала план Б, и что это за план Б?

> Это был поиск работы в моей сети.

Так что я начала общаться с друзьями и наставниками, говоря им, что мне нужно получить какой-то опыт в сфере технологий.
После недели нетворкинга я начала получать разные предложения о работе.
В итоге я прошла два собеседования и получила два оффера.
Но перед тем, как закончить эту статью, я бы хотела сказать еще несколько слов тем людям, которые пытаются прийти в IT из другой сферы:

1. Будьте последовательны: Введите часы качества
2. Учитесь на публике
3. Посещайте встречи
4. Ходите на мероприятия
5. Общайтесь с людьми, когда вы посещаете мероприятия и встречи.
6. Ищите хорошего наставника, это окупится
7. Делитесь своими знаниями так, как считаете нужным.
8. Никогда не смотрите свысока на себя
9. Не переусердствуйте, чтобы это не привело к перегоранию.
10. Никогда не сравнивайте себя с кем-то и не недооценивайте свой прогресс.

Хочу сказать большое спасибо некоторым потрясающим людям, которые оказали большое влияние на мой путь в IT.

Проспер Отемуйва, Сара Драснер, Игнатий Уквуома, Подарок Крофеги Лауры, Колокодес, Самсон Годди, Боладжи оладжид, Обинна Эквуно и многие другие.

***Спасибо за чтение***.
